package A0809;

public class J123 {
	//num이라는 변수에 int형 값을 하나 입력받아
	//출력해라 System.out.print();
	      
	//입력받아 => input.next(); 키보드로 입력을 받아라

	//입력받은 값 num이 10보다 작은 정수이면 small을 출력
	//아니면 big을 출력

	//입력한 값 num이 1,2,3이면 1,2,3중에 하나입니다.
	//아니면 예외입니다.

	//String str변수를 만들고 값을 입력받아라
	// 만약 값이 "멈춰"일때 까지 반복해서 입력받아라
	// "멈춰"가 아니라면 "다시 입력해주세요" 출력
	// 특정 조건이 성립될때까지 반복해라 => while
	      
//	      while(true) {} => 특별한 일이 없다면 무한반복
//	      while(false) {} => 실행하지않는다.
	      
	      
	//문자열을 하나 입력받고 길이가 10이상일때 까지 반복해서 입력받아라
	//문자열을 입력해주세요 : asd
	//문자열을 입력해주세요 : 

	//int형 자료형 num을 하나 입력받아
	//길이가 num인 int형 1차원 배열 arr을 생성하고
	// arr[0] ~ arr의 길이 끝까지 1부터 1씩 커지면서 순차적으로 저장시키고
	// 출력해라

}
